{
    "train_domain_weights": {
        "RedPajamaArXiv_0": 0.0003556162992026657,
        "RedPajamaArXiv_1": 0.00035110756289213896,
        "RedPajamaArXiv_2": 0.00035554595524445176,
        "RedPajamaArXiv_3": 0.0003550536639522761,
        "RedPajamaArXiv_4": 0.00035531187313608825,
        "RedPajamaArXiv_5": 0.0004044216766487807,
        "RedPajamaArXiv_6": 0.0003566858358681202,
        "RedPajamaArXiv_7": 0.0003556555020622909,
        "RedPajamaArXiv_8": 0.00034982842043973505,
        "RedPajamaArXiv_9": 0.00035843052319251,
        "RedPajamaBook_0": 0.0007202299311757088,
        "RedPajamaBook_1": 0.000678963668178767,
        "RedPajamaBook_2": 0.0022024132777005434,
        "RedPajamaBook_3": 0.000972135690972209,
        "RedPajamaBook_4": 0.003473137505352497,
        "RedPajamaBook_5": 0.0025432840920984745,
        "RedPajamaBook_6": 0.002630718285217881,
        "RedPajamaBook_7": 0.001658839639276266,
        "RedPajamaBook_8": 0.017135411500930786,
        "RedPajamaBook_9": 0.001047691679559648,
        "RedPajamaC4_0": 0.041467852890491486,
        "RedPajamaC4_1": 0.04379516839981079,
        "RedPajamaC4_2": 0.023377785459160805,
        "RedPajamaC4_3": 0.03724762797355652,
        "RedPajamaC4_4": 0.04805493727326393,
        "RedPajamaC4_5": 0.030096381902694702,
        "RedPajamaC4_6": 0.030382296070456505,
        "RedPajamaC4_7": 0.031231489032506943,
        "RedPajamaC4_8": 0.03293671831488609,
        "RedPajamaC4_9": 0.040604498237371445,
        "RedPajamaCommonCrawl_0": 0.022335555404424667,
        "RedPajamaCommonCrawl_1": 0.008397562429308891,
        "RedPajamaCommonCrawl_2": 0.04181845858693123,
        "RedPajamaCommonCrawl_3": 0.009940197691321373,
        "RedPajamaCommonCrawl_4": 0.011208378709852695,
        "RedPajamaCommonCrawl_5": 0.0062574357725679874,
        "RedPajamaCommonCrawl_6": 0.009297901764512062,
        "RedPajamaCommonCrawl_7": 0.00620509497821331,
        "RedPajamaCommonCrawl_8": 0.009335548616945744,
        "RedPajamaCommonCrawl_9": 0.010002654045820236,
        "RedPajamaGithub_0": 0.00034698317176662385,
        "RedPajamaGithub_1": 0.0003474801778793335,
        "RedPajamaGithub_2": 0.00034569567651487887,
        "RedPajamaGithub_3": 0.00034772270009852946,
        "RedPajamaGithub_4": 0.0003426831681281328,
        "RedPajamaGithub_5": 0.00034579867497086525,
        "RedPajamaGithub_6": 0.0003475148987490684,
        "RedPajamaGithub_7": 0.00034457241417840123,
        "RedPajamaGithub_8": 0.00034577123005874455,
        "RedPajamaGithub_9": 0.00034974058507941663,
        "RedPajamaStackExchange_0": 0.00037966831587255,
        "RedPajamaStackExchange_1": 0.00037936537410132587,
        "RedPajamaStackExchange_2": 0.0004053146403748542,
        "RedPajamaStackExchange_3": 0.4536914825439453,
        "RedPajamaStackExchange_4": 0.0003835905226878822,
        "RedPajamaStackExchange_5": 0.00038526562275364995,
        "RedPajamaStackExchange_6": 0.00037597419577650726,
        "RedPajamaStackExchange_7": 0.005677943583577871,
        "RedPajamaStackExchange_8": 0.00037464970955625176,
        "RedPajamaStackExchange_9": 0.0004037081089336425,
        "RedPajamaWikipedia_0": 0.0003417121770326048,
        "RedPajamaWikipedia_1": 0.0003413251833990216,
        "RedPajamaWikipedia_2": 0.0003389321791473776,
        "RedPajamaWikipedia_3": 0.00034799770219251513,
        "RedPajamaWikipedia_4": 0.0003415638057049364,
        "RedPajamaWikipedia_5": 0.0003398439148440957,
        "RedPajamaWikipedia_6": 0.00034215033520013094,
        "RedPajamaWikipedia_7": 0.0003438077983446419,
        "RedPajamaWikipedia_8": 0.00034211736056022346,
        "RedPajamaWikipedia_9": 0.00034554407466202974
    },
    "eval_domain_weights": {
        "RedPajamaArXiv": 0.0035976573126390576,
        "RedPajamaBook": 0.03306282527046278,
        "RedPajamaC4": 0.3591947555541992,
        "RedPajamaCommonCrawl": 0.1347987879998982,
        "RedPajamaGithub": 0.0034639626974239945,
        "RedPajamaStackExchange": 0.46245696261757985,
        "RedPajamaWikipedia": 0.0034249945310875773
    }
}