{
  "train_domain_weights": {
    "RedPajamaC4_4": 0.046629283524404826,
    "RedPajamaArXiv_7": 0.00210244756631777,
    "RedPajamaWikipedia_5": 0.00434940298422881,
    "RedPajamaC4_6": 0.046731289066705956,
    "RedPajamaC4_8": 0.04627651435728008,
    "RedPajamaGithub_6": 0.004210562107207825,
    "RedPajamaCommonCrawl_7": 0.036962841647729526,
    "RedPajamaArXiv_4": 0.0021038643099608413,
    "RedPajamaC4_2": 0.04665053467905089,
    "RedPajamaStackExchange_6": 0.0042190625690662524,
    "RedPajamaStackExchange_3": 0.004313984393152028,
    "RedPajamaBook_1": 0.0017270105009038824,
    "RedPajamaGithub_8": 0.004335235547798097,
    "RedPajamaArXiv_3": 0.002106697797246984,
    "RedPajamaWikipedia_1": 0.004389071806234805,
    "RedPajamaArXiv_6": 0.0021265322082499815,
    "RedPajamaGithub_9": 0.00421622908178011,
    "RedPajamaBook_2": 0.0017270105009038824,
    "RedPajamaWikipedia_2": 0.00434940298422881,
    "RedPajamaStackExchange_5": 0.004251647672856892,
    "RedPajamaStackExchange_2": 0.004221896056352395,
    "RedPajamaC4_9": 0.04647627521095313,
    "RedPajamaCommonCrawl_1": 0.036614322711533996,
    "RedPajamaCommonCrawl_3": 0.036716328253835126,
    "RedPajamaGithub_0": 0.004041969613682343,
    "RedPajamaStackExchange_1": 0.004364987164302594,
    "RedPajamaGithub_5": 0.004281399289361389,
    "RedPajamaStackExchange_8": 0.004220479312709324,
    "RedPajamaStackExchange_7": 0.004224729543638538,
    "RedPajamaWikipedia_9": 0.0042913164948628875,
    "RedPajamaArXiv_9": 0.0021038643099608413,
    "RedPajamaGithub_2": 0.004090138897546767,
    "RedPajamaBook_0": 0.001729843988190025,
    "RedPajamaBook_9": 0.001729843988190025,
    "RedPajamaArXiv_5": 0.00210244756631777,
    "RedPajamaCommonCrawl_4": 0.036547735760309646,
    "RedPajamaArXiv_2": 0.0021052810536039126,
    "RedPajamaCommonCrawl_0": 0.036825417514351616,
    "RedPajamaGithub_7": 0.004262981622001462,
    "RedPajamaC4_1": 0.04688146389287151,
    "RedPajamaWikipedia_6": 0.00436073693337338,
    "RedPajamaCommonCrawl_5": 0.036642657584395416,
    "RedPajamaBook_7": 0.0017227602699746685,
    "RedPajamaWikipedia_3": 0.0044188234227393024,
    "RedPajamaStackExchange_9": 0.004316817880438171,
    "RedPajamaArXiv_1": 0.002119448490034625,
    "RedPajamaWikipedia_8": 0.004298400213078244,
    "RedPajamaWikipedia_4": 0.004237480236426179,
    "RedPajamaCommonCrawl_6": 0.03675741381948419,
    "RedPajamaStackExchange_0": 0.004251647672856892,
    "RedPajamaGithub_4": 0.004255897903786106,
    "RedPajamaC4_3": 0.046742623015850526,
    "RedPajamaBook_5": 0.001719926782688526,
    "RedPajamaStackExchange_4": 0.004265815109287604,
    "RedPajamaGithub_1": 0.004265815109287604,
    "RedPajamaC4_7": 0.04676670765778274,
    "RedPajamaWikipedia_7": 0.0043550699588010945,
    "RedPajamaBook_8": 0.0017255937572608112,
    "RedPajamaCommonCrawl_9": 0.036682326406401414,
    "RedPajamaBook_4": 0.0017185100390454547,
    "RedPajamaArXiv_8": 0.0021038643099608413,
    "RedPajamaCommonCrawl_8": 0.03644573021800851,
    "RedPajamaGithub_3": 0.004224729543638538,
    "RedPajamaC4_5": 0.04698771966610186,
    "RedPajamaBook_6": 0.0017312607318330962,
    "RedPajamaBook_3": 0.0017241770136177399,
    "RedPajamaArXiv_0": 0.0021010308226746986,
    "RedPajamaCommonCrawl_2": 0.036544902273023504,
    "RedPajamaC4_0": 0.04662645003711868,
    "RedPajamaWikipedia_0": 0.004274315571146032
  },
  "eval_domain_weights": {
    "RedPajamaArXiv": 0.02156634023275371,
    "RedPajamaGithub": 0.040230040962482706,
    "RedPajamaWikipedia": 0.04367522990532512,
    "RedPajamaStackExchange": 0.04375661232129778,
    "RedPajamaBook": 0.01285842172367957,
    "RedPajamaC4": 0.4741068279847001,
    "RedPajamaCommonCrawl": 0.36380652686977
  }
}